geoCityMap = {
	'合肥': [117.27, 31.86],
	'武汉': [114.31, 30.52],
	"拉萨": [91.11, 29.97],
	'长沙': [113, 28.21],
	'石家庄': [114.48, 38.03],
	'郑州': [113.65, 34.76],
	'天津': [117.2, 39.13],
	'兰州': [103.73, 36.03],
	'济南': [117, 36.65],
	'杭州': [120.19, 30.26],
	'乌鲁木齐': [87.68, 43.77],
	'北京': [116.46, 39.92],
	'贵阳': [106.71, 26.57],
	'南京': [118.78, 32.04],
	'重庆': [106.54, 29.59],
	'西安': [108.95, 34.27],
	'桂林': [110.28, 25.29],
	'成都': [104.06, 30.67],
	'呼和浩特': [111.65, 40.82],
	'长春': [125.35, 43.88],
	'海口': [110.35, 20.02],
	'昆明': [102.73, 25.04],
	'太原': [112.53, 37.87],
	'广州': [113.23, 23.16],
	'南宁': [108.33, 22.84],
	'福州': [119.3, 26.08],
	'上海': [121.48, 31.22],
	'哈尔滨': [126.63, 45.75],
	'西宁': [101.74, 36.56],
	'南昌': [115.89, 28.68],
	'银川': [106.27, 38.47],
	'沈阳': [123.38, 41.8],
	'台北': [121.54, 25.02],
	'香港': [114.12, 22.26],
	'澳门': [113.5, 22.2],
};
geoCityData = [{
		name: "广东",
		value: "11169",
		title: "广州"
	},
	{
		name: "山东",
		value: "10005.83",
		title: "济南"
	},
	{
		name: "河南",
		value: "9559.13",
		title: "郑州"
	},
	{
		name: "四川",
		value: "8302",
		title: "成都"
	},
	{
		name: "江苏",
		value: "8029.3",
		title: "南京"
	},
	{
		name: "河北",
		value: "7519.52",
		title: "石家庄"
	},
	{
		name: "湖南",
		value: "6860.2",
		title: "长沙"
	},
	{
		name: "安徽",
		value: "6254.8",
		title: "合肥"
	},
	{
		name: "湖北",
		value: "5902",
		title: "武汉"
	},
	{
		name: "浙江",
		value: "5657",
		title: "杭州"
	},
	{
		name: "广西",
		value: "4885",
		title: "南宁"
	},
	{
		name: "云南",
		value: "4800.5",
		title: "昆明"
	},
	{
		name: "江西",
		value: "4622.1",
		title: "南昌"
	},
	{
		name: "辽宁",
		value: "4368.9",
		title: "沈阳"
	},
	{
		name: "福建",
		value: "3911",
		title: "福州"
	},
	{
		name: "陕西",
		value: "3835.44",
		title: "西安"
	},
	{
		name: "黑龙江",
		value: "3788.7",
		title: "哈尔滨"
	},
	{
		name: "山西",
		value: "3702.35",
		title: "太原"
	},
	{
		name: "贵州",
		value: "3580",
		title: "贵阳"
	},
	{
		name: "重庆",
		value: "3048.43",
		title: "重庆"
	},
	{
		name: "吉林",
		value: "2717.43",
		title: "长春"
	},
	{
		name: "甘肃",
		value: "2625.71",
		title: "兰州"
	},
	{
		name: "内蒙古",
		value: "2528.6",
		title: "呼和浩特"
	},
	{
		name: "新疆",
		value: "2444.67",
		title: "乌鲁木齐"
	},
	{
		name: "上海",
		value: "2418.33",
		title: "上海"
	},
	{
		name: "台湾",
		value: "2369",
		title: "台北"
	},
	{
		name: "北京",
		value: "2170.7",
		title: "北京"
	},
	{
		name: "天津",
		value: "1556.87",
		title: "天津"
	},
	{
		name: "海南",
		value: "925.76",
		title: "海口"
	},
	{
		name: "香港",
		value: "743",
		title: "香港"
	},
	{
		name: "宁夏",
		value: "681.79",
		title: "银川"
	},
	{
		name: "青海",
		value: "598.38",
		title: "西宁"
	},
	{
		name: "西藏",
		value: "337.15",
		title: "拉萨"
	},
	{
		name: "澳门",
		value: "63.2",
		title: "澳门"
	},
];
module.exports = {
  geoCityMap,
  geoCityData  
}